var startX, startY;
var selList = [];
var a = []
const DS_LONG = ['Понеділок', 'Вівторок', 'Середа', 'Четвер', 'П\'ятниця', 'Субота', 'Неділя'];
const DS = ['Пн', 'Вв', 'Ср', 'Чт', 'Пт', 'Сб', 'Нд'];	
var DAYS_LONG = []
var DAYS = []

const rowDef = {num:-1,grp:'',chZn:0,sub:'',tch:'',kab:0};
const dayClass = 'tt-day';
const grpClass = 'tt-grp';
const tchClass = 'tt-tch';
const kabClass = 'tt-kab';
const subClass = 'tt-sub';

const kabSport = 59;
const kabFalse = 15;

const nullItem = '---';

const lessonsTime = [585, 645, 705, 765, 825, 885, 945];
const sLink = ' tt--link'
const sColor1 = ' tt--color-1';
const sColor2 = ' tt--color-2';
const sColorErr = ' tt--color-3';
const sColorCurr = ' tt--color-4';

var activeCol = 'tch';
var currTime = 0;

//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
function GetCurrentTime() {
	let d = new Date();
	let m = new Date();
	let g = new Date();
	let day = d.getUTCDay();
	let min = 60 * g.getHours() + m.getMinutes();
	let i = 0;
	while (i < 7 && lessonsTime[i] + 3 <= min) {
		i += 1;
	}
	if (i === 7) i = 6;
	if (day === 0 || day === 6) {
		day = 0;
		i = 0;
	} else {
		day -= 1;
	}
	return 10 * day + i;
}

//-------------------------------------------
//-------------------------------------------
function isWorkDay(num) {
	return num < 50 && num % 10 <= 6;
}

//-------------------------------------------
//-- додавання порожніх днів -------------
function addDay(value, col, rows) {
	for (let i = 0; i < DAYS.length; i++) {
		if (isWorkDay(i) && rows.find(row => row.num === i) === undefined) {
			row = {...rowDef};
			row[col] = value;
			row.num = i;
			rows.push(row);
		}
	}
	return rows;
}

//-------------------------------------------
//-- додавання порожніх класів -------------
function addGrp(value, rows) {
	let grps = [];
	for (let row of a) {
		grps.push(row.grp);
	}
	let uniqueGrps = [...new Set(grps)].filter(Boolean);
	for (unGrp of uniqueGrps) {
		if (rows.find(row => row.grp === unGrp) === undefined) {
			row = {...rowDef};
			row.num = value;
			row.grp = unGrp;
			rows.push(row);
		}
	}
	return rows;
}

//-------------------------------------------
//-------------------------------------------
function getColor(x) {
	if (x === '') return sColor1;
	if (typeof x === 'number') {
		if (x === currTime) return sColorCurr;
		x = (Math.trunc(x / 10));
	} else {
		x = Number(x[0]);
	}
	return (isNaN(x) || x % 2 === 1) ? sColor2 : sColor1;
}
	
//-------------------------------------------
//-------------------------------------------
function CreateData() {
	for (let j = 0; j < 7; j++) {
		for (let i = 0; i < 10; i++) {
			DAYS.push(DS[j] + '-' + String(i + 1));
			DAYS_LONG.push(DS_LONG[j] + '-' + String(i + 1));
		}
	}
	for (let row of a0) {
		a.push({num: row[0], grp: row[1], chZn: row[2], sub: row[3], tch: row[4], kab: row[5]});
	}
	currTime = GetCurrentTime();	
	Filter('day', DAYS[currTime]);
}

//-------------------------------------------
//-----------------------------------------
function HTMLFilter(index) {
	if (index >= 0 && index < selList.length) Filter(activeCol, selList[index]);
}
//-----------------------------------------
function Filter(col, value) {
		// можливі помилки
	if (value === '') return;
	if (col === 'kab') {
		value = Number(value);
		if (value <= 0 || value === NaN) return;
	}
	if (col === 'day') {
		index = (value.length <= 4) ? DAYS.indexOf(value) : DAYS_LONG.indexOf(value);
		if (index < 0) return;
	}
		//----------------
	currTime = GetCurrentTime();
	if (col !== activeCol) {
		activeCol = col;
		selList = Unique(col);
		document.getElementById('listBox').innerHTML = '<option>' + selList.join('</option><option>') + '</option>';
	}
		// фільтрування ---------------------------------
	let s = '';
	if (col === 'day') s = FilterDay(value);
	if (col === 'grp') s = FilterGrp(value);
	if (col === 'kab') s = FilterKab(value);
	if (col === 'tch') s = FilterTch(value);

	if (col === 'day' && value.length <= 4) value = DAYS_LONG[DAYS.indexOf(value)];
	document.getElementById('listBox').selectedIndex = selList.indexOf(value);
	document.getElementById('tableData').innerHTML = s;
}

//-------------------------------------------
//-------------------------------------------
function Unique(col) {
	let list = [];
	let myList = [];
	if (col === 'day') col = 'num';
	for (let row of a) {
		list.push(row[col]);
	}
	myList = [...new Set(list)].filter(Boolean);
	if (col === 'kab' || col === 'num') {
		if (col === 'num') myList.push(0);
		myList.sort((x, y) => x - y);
		if (col === 'num') {myList.forEach((num, index) => {myList[index] = DAYS_LONG[num];});}
	} else {
		myList.sort();
	}
	return myList;
}

//-------------------------------------------
//-----------------------------------------------
function touchStart() {
	startX = event.touches[0].clientX;
	startY = event.touches[0].clientY;
}
//-----------------------------------------------
function touchEnd(n) {
	let dX = event.changedTouches[0].clientX - startX;
	let dY = event.changedTouches[0].clientY - startY;
	if (dX > 50 && Math.abs(dX) > Math.abs(dY)) HTMLFilter(n - 1);
	if (dX < -50 && Math.abs(dX) > Math.abs(dY)) HTMLFilter(n + 1);
}

//-------------------------------------------
//-------------------------------------------
function SaveDay(s, color) {
	res = '';
	if (s === nullItem || s === '') {
		res = '<td class="' + dayClass + color + '">' + s + '</td>';
	} else {
		res = '<td class="' + dayClass + color + sLink + '" onclick="Filter(\'day\',\'' + s + '\')">' + s + '</td>';
	}
	return res;
}
function SaveGrp(s, color) {
	res = '';
	if (s === nullItem || s === '') {
		res = '<td class="' + grpClass + color + '">' + s + '</td>';		
	} else {
		res = '<td class="' + grpClass + color + sLink + '" onclick="Filter(\'grp\',\'' + s + '\')">' + s + '</td>';
	}
	return res;
}
function SaveSub(s, x, color) {
	let sAdd = (x === 0 || s === nullItem) ? s : ((x < 0) ? '*&nbsp;' + s : s + '&nbsp;*');
	res = '<td class="' + subClass + color + '">' + sAdd + '</td>';		
	return res;	
}
function SaveTch(s, color) {
	res = '';
	if (s === nullItem || s === '') {
		res = '<td class="' + tchClass + color + '">' + s + '</td>';
	} else {
		res = '<td class="' + tchClass + color + sLink + '" onclick="Filter(\'tch\',\'' + s + '\')">' + s + '</td>';
	}
	return res;	
}
function SaveKab(n, color, grp) {
	if (n === kabFalse && grp.length > 0 && grp[0] >= '1' && grp[0] <= '9') color = sColorErr;
	res = '';
	if (n <= 0) {
		res = '<td class="' + kabClass + color + '"></td>';
	} else {
		res = '<td class="' + kabClass + color + sLink + '" onclick="Filter(\'kab\',\'' + String(n) + '\')">' + String(n) + '</td>';
	}
	return res;	
}
//-------------------------------------------
//-------------------------------------------
function FilterDay(value) {

		// якщо Понеділок-4 (повне) - то записуємо скорочено Пн-4
	if (value.length > 4) {
		value = Number(DAYS_LONG.indexOf(value));
	} else {
		value = Number(DAYS.indexOf(value));
	}

	let rows = a.filter(row => row.num === value);
	if (isWorkDay(value)) rows = addGrp(value, rows); 
	rows.sort((x, y) => {if (x.grp !== y.grp) return x.grp.localeCompare(y.grp); if (x.chZn !== y.chZn) return y.chZn - x.chZn;
						 if (x.sub !== y.sub) return x.sub.localeCompare(y.sub); return x.kab - y.kab});
	let s = '';
	let rowPrev = {...rowDef};
	let	color;
	for (let row of rows) {
		color = getColor(row.grp);

			//---перевірка на помилки
		if (row.grp === rowPrev.grp) {
			if (rowPrev.chZn === 1 && row.chZn === 0) color = sColorErr;
			if (rowPrev.chZn === 0 && row.chZn !== 0) color = sColorErr;
			if (rowPrev.chZn === -1 && row.chZn !== -1) color = sColorErr;
			if (row.chZn === rowPrev.chZn && row.tch === rowPrev.tch) color = sColorErr;
			if (row.chZn === rowPrev.chZn && row.kab === rowPrev.kab && row.kab !== kabSport) color = sColorErr;
		}
			//---------		

		s += '<tr>';
		(row.grp === rowPrev.grp) ? s += SaveGrp(nullItem, color) : s += SaveGrp(row.grp, color);
		(row.grp === rowPrev.grp && row.sub === rowPrev.sub) ? s += SaveSub(nullItem, row.chZn, color) : s += SaveSub(row.sub, row.chZn, color);
		s += SaveKab(row.kab, color, row.grp) + SaveTch(row.tch, color) + '</tr>';
		rowPrev = {...row};		
	}
	return s;
}

//-------------------------------------------
//-------------------------------------------
function FilterGrp(value) {
	let rows = a.filter(row => row.grp === value);
	rows = addDay(value, 'grp', rows);
	rows.sort((x, y) => {if (x.num !== y.num) return x.num - y.num; if (x.chZn !== y.chZn) return y.chZn - x.chZn;
						 if (x.sub !== y.sub) return x.sub.localeCompare(y.sub); return x.kab - y.kab});	
	let s = '';
	let rowPrev = {...rowDef};
	let	color;	
	for (let row of rows) {
		color = getColor(row.num);
		
			//---перевірка на помилки
		if (row.num === rowPrev.num) {
			if (rowPrev.chZn === 1 && row.chZn === 0) color = sColorErr;
			if (rowPrev.chZn === 0 && row.chZn !== 0) color = sColorErr;
			if (rowPrev.chZn === -1 && row.chZn !== -1) color = sColorErr;
			if (row.chZn === rowPrev.chZn && row.tch === rowPrev.tch) color = sColorErr;
			if (row.chZn === rowPrev.chZn && row.kab === rowPrev.kab && row.kab !== kabSport) color = sColorErr;
		}
			//---------
			
		s += '<tr>';
		(row.num === rowPrev.num) ? s += SaveDay(nullItem, color) : s += SaveDay(DAYS[row.num], color);
		(row.num === rowPrev.num && row.sub === rowPrev.sub) ? s += SaveSub(nullItem, row.chZn, color) : s += SaveSub(row.sub, row.chZn, color);
		s += SaveKab(row.kab, color, row.grp) + SaveTch(row.tch, color) + '</tr>';
		rowPrev = {...row};		
	}
	return s;	
}

//-------------------------------------------
//-------------------------------------------
function FilterTch(value) {
	let rows = a.filter(row => row.tch === value);
	rows = addDay(value, 'tch', rows);
	rows.sort((x, y) => {if (x.num !== y.num) return x.num - y.num; if (x.chZn !== y.chZn) return y.chZn - x.chZn;
						 if (x.grp !== y.grp) return x.grp.localeCompare(y.grp); return x.kab - y.kab});
	let s = '';
	let rowPrev = {...rowDef};
	let	color;	
	for (let row of rows) {
		color = getColor(row.num);

			//---перевірка на помилки
		if (row.num === rowPrev.num) {
			if (row.chZn !== -1 || rowPrev.chZn !== 1) color = sColorErr;
			if (row.chZn === -1 && rowPrev.chZn === 1 && row.sub === rowPrev.sub 
				&& row.grp === rowPrev.grp && row.kab === rowPrev.kab) color = sColorErr;
		}
			//---------

		s += '<tr>';
		(row.num === rowPrev.num) ? s += SaveDay(nullItem, color) : s += SaveDay(DAYS[row.num], color);
		(row.num === rowPrev.num && row.grp === rowPrev.grp) ? s += SaveGrp(nullItem, color) : s += SaveGrp(row.grp, color);
		s += SaveSub(row.sub, row.chZn, color) + SaveKab(row.kab, color, row.grp) + '</tr>';
		rowPrev = {...row};
	}
	return s;	
}	

//-------------------------------------------
//-------------------------------------------
function FilterKab(value) {
	let rows = a.filter(row => row.kab === value);
	rows = addDay(value, 'kab', rows);
	rows.sort((x, y) => {if (x.num !== y.num) return x.num - y.num; if (x.chZn !== y.chZn) return y.chZn - x.chZn;
						 if (x.sub !== y.sub) return x.sub.localeCompare(y.sub); return x.grp.localeCompare(y.grp)});
	let s = '';
	let rowPrev = {...rowDef};
	let	color;	
	for (let row of rows) {
		color = getColor(row.num);
		
			//---перевірка на помилки
		if (row.num === rowPrev.num) {
				// фізкультуа
			if (row.kab === kabSport) {
				if (rowPrev.chZn === 1 && row.chZn === 0) color = sColorErr;
				if (rowPrev.chZn === 0 && row.chZn !== 0) color = sColorErr;
				if (rowPrev.chZn === -1 && row.chZn !== -1) color = sColorErr;
				if (row.chZn === rowPrev.chZn && row.tch === rowPrev.tch) color = sColorErr;
			} else {
				if (row.chZn !== -1 || rowPrev.chZn !== 1) color = sColorErr;
				if (row.chZn === -1 && rowPrev.chZn === 1 && row.sub === rowPrev.sub 
					&& row.grp === rowPrev.grp && row.tch === rowPrev.tch) color = sColorErr;
			}
		}
			//---------
			
		s += '<tr>';
		(row.num === rowPrev.num) ? s += SaveDay(nullItem, color) : s += SaveDay(DAYS[row.num], color);
		(row.num === rowPrev.num && row.sub === rowPrev.sub) ? s += SaveSub(nullItem, row.chZn, color) : s += SaveSub(row.sub, row.chZn, color);
		s += SaveGrp(row.grp, color) + SaveTch(row.tch, color) + '</tr>';
		rowPrev = {...row};
	}
	return s;
}	

//-------------------------------------------
//-------------------------------------------
var a0=
[[0,"5-А",0,"математика","Курій Т.Б.",16],[10,"5-А",0,"математика","Курій Т.Б.",17],[20,"5-А",0,"фіз-ра","Дубик М.І.",59],[30,"5-А",0,"фіз-ра","Дубик М.І.",59],[40,"5-А",1,"Укр. і світ","Плетінка В.М.",25],[1,"5-А",0,"укр.літ.","Турко Г.Б.",35],[11,"5-А",0,"укр.мова","Турко Г.Б.",16],[21,"5-А",0,"МПЗ","Горбач Л.Ф.",17],[31,"5-А",0,"англ.мова","Пронів Х.І.",20],[31,"5-А",0,"англ.мова","Смолинець Г.А.",17],[41,"5-А",0,"математика","Курій Т.Б.",16],[2,"5-А",0,"укр.мова","Македонська О.Р.",8],[2,"5-А",0,"укр.мова","Турко Г.Б.",17],[12,"5-А",1,"мистецтво","Цуркан І.М.",7],[22,"5-А",0,"заруб.літ.","Кардинал О.П.",15],[32,"5-А",0,"математика","Курій Т.Б.",17],[42,"5-А",0,"математика","Курій Т.Б.",17],[3,"5-А",0,"англ.мова","Пронів Х.І.",22],[3,"5-А",0,"англ.мова","Смолинець Г.А.",17],[13,"5-А",0,"англ.мова","Пронів Х.І.",22],[13,"5-А",0,"англ.мова","Смолинець Г.А.",17],[23,"5-А",0,"англ.мова","Пронів Х.І.",26],[23,"5-А",0,"англ.мова","Смолинець Г.А.",17],[33,"5-А",0,"укр.мова","Македонська О.Р.",8],[33,"5-А",0,"укр.мова","Турко Г.Б.",35],[43,"5-А",0,"укр.мова","Македонська О.Р.",8],[43,"5-А",0,"укр.мова","Турко Г.Б.",35],[4,"5-А",0,"технології","Шевчук М.Б.",6],[4,"5-А",0,"технології","Цуркан І.М.",7],[14,"5-А",0,"фіз-ра","Дубик М.І.",59],[24,"5-А",0,"математика","Курій Т.Б.",16],[34,"5-А",0,"еврика","Курій Т.Б.",16],[44,"5-А",0,"англ.мова","Пронів Х.І.",22],[44,"5-А",0,"англ.мова","Смолинець Г.А.",19],[5,"5-А",0,"ТФВ","Когут С.С.",34],[15,"5-А",0,"інформатика","Білібін Р.В.",24],[15,"5-А",0,"інформатика","Смоляк І.Я.",32],[25,"5-А",0,"укр.літ.","Турко Г.Б.",35],[35,"5-А",0,"Укр. і світ","Плетінка В.М.",25],[45,"5-А",0,"МПЗ","Горбач Л.Ф.",17],[26,"5-А",0,"навч. разом","Смолинець Г.А.",17],[40,"5-А",-1,"заруб.літ.","Кардинал О.П.",30],[12,"5-А",-1,"музика","Паралюш О.М.",3],[0,"5-Б",0,"укр.мова","Македонська О.Р.",8],[0,"5-Б",0,"укр.мова","Турко Г.Б.",35],[10,"5-Б",0,"пізн.природу","Горбач Л.Ф.",18],[20,"5-Б",0,"укр.літ.","Македонська О.Р.",8],[30,"5-Б",0,"укр.літ.","Македонська О.Р.",8],[40,"5-Б",1,"інформатика","Білібін Р.В.",24],[40,"5-Б",1,"інформатика","Смоляк І.Я.",32],[1,"5-Б",0,"STEM","Кузій О.І.",1],[1,"5-Б",0,"STEM","Федюк Н.М.",29],[11,"5-Б",0,"англ.мова","Пронів Х.І.",3],[11,"5-Б",0,"англ.мова","Смолинець Г.А.",18],[21,"5-Б",0,"заруб.літ.","Друзь О.Ф.",31],[31,"5-Б",0,"укр.мова","Македонська О.Р.",8],[41,"5-Б",0,"ЗБД","Тарасюк Р.М.",5],[2,"5-Б",0,"математика","Каравець Г.М.",33],[12,"5-Б",0,"математика","Каравець Г.М.",33],[22,"5-Б",0,"укр.мова","Македонська О.Р.",8],[22,"5-Б",0,"укр.мова","Турко Г.Б.",28],[32,"5-Б",0,"математика","Каравець Г.М.",33],[42,"5-Б",0,"математика","Каравець Г.М.",1],[3,"5-Б",0,"фіз-ра","Тиндик Т.О.",59],[13,"5-Б",0,"математика","Каравець Г.М.",33],[23,"5-Б",0,"історія","Плетінка В.М.",25],[33,"5-Б",0,"англ.мова","Пронів Х.І.",30],[33,"5-Б",0,"англ.мова","Смолинець Г.А.",15],[43,"5-Б",0,"пізн.природу","Горбач Л.Ф.",17],[4,"5-Б",0,"музика","Паралюш О.М.",3],[14,"5-Б",0,"фіз-ра","Тиндик Т.О.",59],[24,"5-Б",0,"математика","Каравець Г.М.",33],[34,"5-Б",0,"фіз-ра","Тиндик Т.О.",59],[44,"5-Б",0,"укр.мова","Македонська О.Р.",8],[44,"5-Б",0,"укр.мова","Турко Г.Б.",28],[5,"5-Б",0,"англ.мова","Пронів Х.І.",35],[5,"5-Б",0,"англ.мова","Смолинець Г.А.",27],[15,"5-Б",0,"мистецтво","Пасієвич І.Р.",1],[25,"5-Б",0,"англ.мова","Пронів Х.І.",28],[25,"5-Б",0,"англ.мова","Смолинець Г.А.",23],[35,"5-Б",0,"технології","Шевчук М.Б.",6],[35,"5-Б",0,"технології","Цуркан І.М.",7],[26,"5-Б",0,"інформатика","Білібін Р.В.",24],[26,"5-Б",0,"інформатика","Смоляк І.Я.",32],[40,"5-Б",-1,"заруб.літ.","Друзь О.Ф.",31],[16,"5-Б",-1,"STEM","Кузій О.І.",1],[16,"5-Б",-1,"STEM","Федюк Н.М.",29],[36,"5-Б",-1,"духовність","Павлів О.Я.",19],[0,"5-В",0,"STEM","Федюк Н.М.",29],[0,"5-В",0,"STEM","Кузій О.І.",1],[10,"5-В",0,"математика","Чуприна О.В.",26],[20,"5-В",0,"мистецтво","Пасієвич І.Р.",28],[30,"5-В",0,"англ.мова","Пронів Х.І.",20],[30,"5-В",0,"англ.мова","Смолинець Г.А.",17],[40,"5-В",0,"фіз-ра","Дубик М.І.",59],[1,"5-В",0,"укр.мова","Дубецька С.Я.",28],[11,"5-В",0,"математика","Чуприна О.В.",26],[21,"5-В",0,"укр.мова","Малко Н.Я.",31],[21,"5-В",0,"укр.мова","Дубецька С.Я.",15],[31,"5-В",0,"фіз-ра","Дубик М.І.",59],[41,"5-В",1,"інформатика","Білібін Р.В.",24],[41,"5-В",1,"інформатика","Смоляк І.Я.",32],[2,"5-В",0,"математика","Чуприна О.В.",26],[12,"5-В",0,"пізн.природу","Федюк Н.М.",1],[22,"5-В",0,"фіз-ра","Дубик М.І.",59],[32,"5-В",0,"математика","Чуприна О.В.",26],[42,"5-В",0,"математика","Чуприна О.В.",26],[3,"5-В",0,"укр.літ.","Дубецька С.Я.",29],[13,"5-В",0,"укр.мова","Малко Н.Я.",31],[13,"5-В",0,"укр.мова","Дубецька С.Я.",23],[23,"5-В",0,"заруб.літ.","Друзь О.Ф.",31],[33,"5-В",0,"історія","Плетінка В.М.",25],[43,"5-В",0,"укр.літ.","Дубецька С.Я.",23],[4,"5-В",0,"англ.мова","Пронів Х.І.",35],[4,"5-В",0,"англ.мова","Смолинець Г.А.",11],[14,"5-В",0,"англ.мова","Пронів Х.І.",21],[14,"5-В",0,"англ.мова","Смолинець Г.А.",17],[24,"5-В",0,"математика","Чуприна О.В.",26],[34,"5-В",0,"технології","Шевчук М.Б.",6],[34,"5-В",0,"технології","Цуркан І.М.",7],[44,"5-В",0,"укр.мова","Малко Н.Я.",31],[44,"5-В",0,"укр.мова","Дубецька С.Я.",23],[5,"5-В",0,"пізн.природу","Федюк Н.М.",29],[15,"5-В",0,"музика","Паралюш О.М.",3],[25,"5-В",0,"інформатика","Білібін Р.В.",24],[25,"5-В",0,"інформатика","Смоляк І.Я.",32],[35,"5-В",0,"ЗБД","Гумен Б.Б.",4],[45,"5-В",0,"англ.мова","Пронів Х.І.",22],[45,"5-В",0,"англ.мова","Смолинець Г.А.",19],[16,"5-В",1,"STEM","Федюк Н.М.",29],[16,"5-В",1,"STEM","Кузій О.І.",1],[41,"5-В",-1,"заруб.літ.","Друзь О.Ф.",31],[6,"5-В",-1,"духовність","Павлів О.Я.",23],[0,"6-А",0,"математика","Чуприна О.В.",26],[10,"6-А",0,"інформатика","Кіт Н.П.",32],[10,"6-А",0,"інформатика","Білібін Р.В.",24],[20,"6-А",0,"укр.мова","Грушкевич С.З.",15],[30,"6-А",0,"географія","Лемеха О.В.",18],[40,"6-А",0,"укр.мова","Грушкевич С.З.",15],[1,"6-А",0,"фіз-ра","Дубик М.І.",59],[11,"6-А",0,"МПЗ","Горбач Л.Ф.",17],[21,"6-А",0,"математика","Чуприна О.В.",26],[31,"6-А",0,"математика","Чуприна О.В.",26],[41,"6-А",0,"Укр. і світ","Косів В.В.",30],[2,"6-А",1,"мистецтво","Цуркан І.М.",7],[12,"6-А",0,"фіз-ра","Дубик М.І.",59],[22,"6-А",0,"англ.мова","Сторощук Н.І.",22],[32,"6-А",0,"TФВ","Когут С.С.",34],[42,"6-А",0,"укр.літ.","Грушкевич С.З.",15],[3,"6-А",0,"англ.мова","Сторощук Н.І.",30],[13,"6-А",0,"математика","Чуприна О.В.",26],[23,"6-А",0,"навч. разом","Кардинал О.П.",30],[33,"6-А",0,"МПЗ","Горбач Л.Ф.",17],[43,"6-А",0,"математика","Чуприна О.В.",26],[4,"6-А",0,"укр.мова","Грушкевич С.З.",15],[14,"6-А",0,"Укр. і світ","Косів В.В.",30],[24,"6-А",0,"фіз-ра","Дубик М.І.",59],[34,"6-А",0,"англ.мова","Сторощук Н.І.",30],[44,"6-А",0,"англ.мова","Сторощук Н.І.",34],[5,"6-А",0,"укр.літ.","Грушкевич С.З.",15],[15,"6-А",0,"заруб.літ.","Кардинал О.П.",30],[25,"6-А",0,"математика","Чуприна О.В.",26],[35,"6-А",0,"укр.мова","Грушкевич С.З.",15],[45,"6-А",0,"еврика","Чуприна О.В.",26],[6,"6-А",0,"географія","Лемеха О.В.",18],[16,"6-А",0,"англ.мова","Сторощук Н.І.",19],[36,"6-А",0,"технології","Шевчук М.Б.",6],[2,"6-А",-1,"музика","Паралюш О.М.",3],[26,"6-А",-1,"Укр. і світ","Косів В.В.",15],[46,"6-А",-1,"заруб.літ.","Кардинал О.П.",30],[0,"6-Б",0,"англ.мова","Коваль О.В.",18],[0,"6-Б",0,"англ.мова","Сторощук Н.І.",21],[10,"6-Б",0,"географія","Тарасюк Р.М.",5],[20,"6-Б",0,"укр.мова","Боднарчук О.В.",25],[20,"6-Б",0,"укр.мова","Дубецька С.Я.",22],[30,"6-Б",0,"історія","Косів В.В.",25],[40,"6-Б",0,"укр.мова","Боднарчук О.В.",18],[40,"6-Б",0,"укр.мова","Дубецька С.Я.",21],[1,"6-Б",0,"математика","Каравець Г.М.",33],[11,"6-Б",0,"математика","Каравець Г.М.",33],[21,"6-Б",0,"математика","Каравець Г.М.",33],[31,"6-Б",0,"математика","Каравець Г.М.",33],[41,"6-Б",0,"математика","Каравець Г.М.",1],[2,"6-Б",0,"інформатика","Білібін Р.В.",24],[2,"6-Б",0,"інформатика","Смоляк І.Я.",32],[12,"6-Б",0,"пізн.природу","Горбач Л.Ф.",17],[22,"6-Б",0,"математика","Каравець Г.М.",33],[32,"6-Б",0,"географія","Тарасюк Р.М.",5],[42,"6-Б",0,"мистецтво","Цуркан І.М.",7],[3,"6-Б",0,"фіз-ра","Дубик М.І.",59],[13,"6-Б",0,"англ.мова","Коваль О.В.",15],[13,"6-Б",0,"англ.мова","Сторощук Н.І.",21],[23,"6-Б",0,"укр.літ.","Боднарчук О.В.",22],[33,"6-Б",0,"англ.мова","Коваль О.В.",20],[33,"6-Б",0,"англ.мова","Сторощук Н.І.",21],[43,"6-Б",1,"інформатика","Білібін Р.В.",24],[43,"6-Б",1,"інформатика","Смоляк І.Я.",32],[4,"6-Б",0,"укр.мова","Боднарчук О.В.",33],[4,"6-Б",0,"укр.мова","Дубецька С.Я.",23],[14,"6-Б",0,"заруб.літ.","Кардинал О.П.",15],[24,"6-Б",0,"англ.мова","Коваль О.В.",15],[24,"6-Б",0,"англ.мова","Сторощук Н.І.",22],[34,"6-Б",0,"укр.мова","Боднарчук О.В.",33],[34,"6-Б",0,"укр.мова","Дубецька С.Я.",23],[44,"6-Б",0,"укр.літ.","Боднарчук О.В.",33],[5,"6-Б",0,"STEM","Тарасюк Р.М.",5],[5,"6-Б",0,"STEM","Кузій О.І.",1],[15,"6-Б",0,"ЗБД","Тарасюк Р.М.",5],[25,"6-Б",0,"технології","Шевчук М.Б.",6],[25,"6-Б",0,"технології","Цуркан І.М.",7],[35,"6-Б",0,"пізн.природу","Горбач Л.Ф.",17],[45,"6-Б",0,"історія","Косів В.В.",33],[6,"6-Б",0,"музика","Паралюш О.М.",3],[26,"6-Б",1,"STEM","Тарасюк Р.М.",5],[26,"6-Б",1,"STEM","Кузій О.І.",1],[36,"6-Б",0,"фіз-ра","Дубик М.І.",59],[46,"6-Б",0,"фіз-ра","Дубик М.І.",59],[43,"6-Б",-1,"заруб.літ.","Кардинал О.П.",30],[26,"6-Б",-1,"духовність","Павлів О.Я.",19],[0,"6-В",0,"математика","Каравець Г.М.",33],[10,"6-В",0,"математика","Каравець Г.М.",33],[20,"6-В",0,"математика","Каравець Г.М.",33],[30,"6-В",0,"математика","Каравець Г.М.",33],[40,"6-В",0,"математика","Каравець Г.М.",1],[1,"6-В",0,"англ.мова","Сторощук Н.І.",21],[1,"6-В",0,"англ.мова","Коваль О.В.",18],[11,"6-В",0,"англ.мова","Сторощук Н.І.",21],[11,"6-В",0,"англ.мова","Коваль О.В.",20],[21,"6-В",0,"укр.літ.","Боднарчук О.В.",23],[31,"6-В",0,"історія","Косів В.В.",1],[41,"6-В",0,"пізн.природу","Кузій О.І.",33],[2,"6-В",0,"пізн.природу","Кузій О.І.",1],[12,"6-В",0,"заруб.літ.","Кардинал О.П.",30],[22,"6-В",0,"укр.мова","Боднарчук О.В.",25],[22,"6-В",0,"укр.мова","Кульчицька-В О.Я.",11],[32,"6-В",0,"фіз-ра","Дубик М.І.",59],[42,"6-В",0,"укр.мова","Боднарчук О.В.",33],[42,"6-В",0,"укр.мова","Кульчицька-В О.Я.",11],[3,"6-В",0,"інформатика","Білібін Р.В.",24],[3,"6-В",0,"інформатика","Смоляк І.Я.",32],[13,"6-В",0,"укр.мова","Боднарчук О.В.",18],[13,"6-В",0,"укр.мова","Кульчицька-В О.Я.",11],[23,"6-В",0,"математика","Каравець Г.М.",33],[33,"6-В",0,"укр.мова","Боднарчук О.В.",33],[33,"6-В",0,"укр.мова","Кульчицька-В О.Я.",11],[43,"6-В",0,"фіз-ра","Дубик М.І.",59],[4,"6-В",0,"STEM","Тарасюк Р.М.",5],[4,"6-В",0,"STEM","Кузій О.І.",1],[14,"6-В",0,"географія","Лемеха О.В.",18],[24,"6-В",0,"технології","Шевчук М.Б.",6],[24,"6-В",0,"технології","Цуркан І.М.",7],[34,"6-В",0,"ЗБД","Гумен Б.Б.",4],[44,"6-В",1,"інформатика","Білібін Р.В.",24],[44,"6-В",1,"інформатика","Смоляк І.Я.",32],[5,"6-В",0,"укр.літ.","Боднарчук О.В.",11],[15,"6-В",0,"фіз-ра","Дубик М.І.",59],[25,"6-В",0,"географія","Лемеха О.В.",18],[35,"6-В",0,"англ.мова","Сторощук Н.І.",21],[35,"6-В",0,"англ.мова","Коваль О.В.",20],[45,"6-В",0,"англ.мова","Сторощук Н.І.",21],[45,"6-В",0,"англ.мова","Коваль О.В.",28],[6,"6-В",0,"мистецтво","Цуркан І.М.",7],[16,"6-В",0,"музика","Паралюш О.М.",3],[26,"6-В",1,"духовність","Павлів О.Я.",19],[46,"6-В",0,"історія","Косів В.В.",1],[44,"6-В",-1,"заруб.літ.","Кардинал О.П.",30],[26,"6-В",-1,"STEM","Кузій О.І.",1],[26,"6-В",-1,"STEM","Тарасюк Р.М.",5],[0,"7-А",0,"укр.мова","Дубецька С.Я.",22],[10,"7-А",0,"англ.мова","Пронів Х.І.",22],[20,"7-А",0,"фіз-ра","Тиндик Т.О.",59],[30,"7-А",0,"укр.мова","Дубецька С.Я.",22],[40,"7-А",1,"алгебра","Кіт Н.П.",22],[1,"7-А",1,"мистецтво","Цуркан І.М.",7],[11,"7-А",0,"алгебра","Кіт Н.П.",22],[21,"7-А",0,"англ.мова","Пронів Х.І.",22],[31,"7-А",0,"алгебра","Кіт Н.П.",22],[41,"7-А",0,"англ.мова","Пронів Х.І.",22],[2,"7-А",0,"алгебра","Кіт Н.П.",22],[12,"7-А",0,"геометрія","Кіт Н.П.",22],[22,"7-А",0,"біологія","Горбач Л.Ф.",17],[32,"7-А",0,"геометрія","Кіт Н.П.",22],[42,"7-А",0,"укр.мова","Дубецька С.Я.",22],[3,"7-А",0,"фізика","Когут С.С.",34],[13,"7-А",0,"історія","Плетінка В.М.",22],[23,"7-А",0,"інформатика","Кіт Н.П.",24],[23,"7-А",0,"інформатика","Смоляк І.Я.",32],[33,"7-А",0,"хімія","Федюк Н.М.",22],[43,"7-А",0,"англ.мова","Пронів Х.І.",22],[4,"7-А",0,"заруб.літ.","Кардинал О.П.",15],[14,"7-А",0,"укр.літ.","Дубецька С.Я.",22],[24,"7-А",0,"географія","Лемеха О.В.",18],[34,"7-А",0,"фізика","Когут С.С.",15],[44,"7-А",0,"географія","Лемеха О.В.",18],[5,"7-А",0,"біологія","Горбач Л.Ф.",17],[15,"7-А",0,"хімія","Федюк Н.М.",15],[25,"7-А",0,"історія","Плетінка В.М.",22],[35,"7-А",0,"англ.мова","Пронів Х.І.",22],[45,"7-А",0,"фіз-ра","Тиндик Т.О.",59],[6,"7-А",0,"навч. разом","Пронів Х.І.",22],[16,"7-А",0,"технології","Шевчук М.Б.",6],[26,"7-А",1,"еврика","Кіт Н.П.",22],[36,"7-А",0,"фіз-ра","Тиндик Т.О.",59],[46,"7-А",0,"укр.літ.","Дубецька С.Я.",22],[40,"7-А",-1,"геометрія","Кіт Н.П.",22],[1,"7-А",-1,"музика","Паралюш О.М.",3],[26,"7-А",-1,"заруб.літ.","Кардинал О.П.",15],[0,"7-Б",0,"фізика","Когут С.С.",34],[10,"7-Б",0,"укр.літ.","Грушкевич С.З.",15],[20,"7-Б",0,"геометрія","Чуприна О.В.",26],[30,"7-Б",0,"інформатика","Кіт Н.П.",32],[30,"7-Б",0,"інформатика","Білібін Р.В.",24],[40,"7-Б",1,"алгебра","Чуприна О.В.",26],[1,"7-Б",0,"алгебра","Чуприна О.В.",26],[11,"7-Б",0,"укр.мова","Грушкевич С.З.",15],[21,"7-Б",0,"укр.мова","Грушкевич С.З.",15],[31,"7-Б",0,"хімія","Федюк Н.М.",29],[41,"7-Б",0,"укр.мова","Грушкевич С.З.",15],[2,"7-Б",0,"англ.мова","Пронів Х.І.",30],[12,"7-Б",0,"алгебра","Чуприна О.В.",26],[22,"7-Б",0,"фіз-ра","Тиндик Т.О.",59],[32,"7-Б",0,"історія","Плетінка В.М.",25],[42,"7-Б",0,"англ.мова","Пронів Х.І.",23],[3,"7-Б",0,"заруб.літ.","Кардинал О.П.",28],[13,"7-Б",1,"мистецтво","Цуркан І.М.",7],[23,"7-Б",0,"географія","Лемеха О.В.",18],[33,"7-Б",0,"алгебра","Чуприна О.В.",26],[43,"7-Б",0,"технології","Шевчук М.Б.",6],[4,"7-Б",0,"біологія","Горбач Л.Ф.",17],[14,"7-Б",0,"хімія","Федюк Н.М.",29],[24,"7-Б",0,"англ.мова","Пронів Х.І.",28],[34,"7-Б",0,"англ.мова","Пронів Х.І.",22],[44,"7-Б",0,"біологія","Горбач Л.Ф.",17],[5,"7-Б",0,"геометрія","Чуприна О.В.",26],[15,"7-Б",0,"англ.мова","Пронів Х.І.",28],[25,"7-Б",0,"фізика","Когут С.С.",34],[35,"7-Б",0,"фіз-ра","Тиндик Т.О.",59],[45,"7-Б",0,"географія","Лемеха О.В.",18],[6,"7-Б",0,"навч. разом","Грушкевич С.З.",15],[16,"7-Б",0,"історія","Плетінка В.М.",25],[26,"7-Б",1,"заруб.літ.","Кардинал О.П.",28],[36,"7-Б",0,"укр.літ.","Грушкевич С.З.",15],[46,"7-Б",0,"фіз-ра","Тиндик Т.О.",59],[40,"7-Б",-1,"геометрія","Чуприна О.В.",26],[13,"7-Б",-1,"музика","Паралюш О.М.",3],[26,"7-Б",-1,"еврика","Чуприна О.В.",26],[0,"7-В",0,"географія","Тарасюк Р.М.",5],[10,"7-В",0,"музика","Паралюш О.М.",3],[20,"7-В",0,"хімія","Кузій О.І.",29],[30,"7-В",1,"всв.історія","Плетінка В.М.",25],[40,"7-В",0,"біологія","Кузій О.І.",33],[1,"7-В",0,"фізика","Когут С.С.",34],[11,"7-В",0,"геометрія","Олійник Т.М.",19],[21,"7-В",0,"алгебра","Олійник Т.М.",19],[31,"7-В",0,"географія","Тарасюк Р.М.",5],[41,"7-В",0,"алгебра","Олійник Т.М.",19],[2,"7-В",0,"укр.мова","Малко Н.Я.",20],[2,"7-В",0,"укр.мова","Дубецька С.Я.",28],[12,"7-В",0,"укр.літ.","Македонська О.Р.",8],[22,"7-В",0,"укр.мова","Малко Н.Я.",3],[22,"7-В",0,"укр.мова","Дубецька С.Я.",3],[32,"7-В",0,"інформатика","Білібін Р.В.",24],[32,"7-В",0,"інформатика","Смоляк І.Я.",32],[42,"7-В",1,"інформатика","Білібін Р.В.",24],[42,"7-В",1,"інформатика","Смоляк І.Я.",32],[3,"7-В",0,"алгебра","Олійник Т.М.",19],[13,"7-В",0,"STEM","Тарасюк Р.М.",5],[13,"7-В",0,"STEM","Кузій О.І.",29],[23,"7-В",0,"англ.мова","Маркевич П.В.",15],[23,"7-В",0,"англ.мова","Приймак Л.А.",21],[33,"7-В",0,"укр.мова","Малко Н.Я.",31],[33,"7-В",0,"укр.мова","Дубецька С.Я.",23],[43,"7-В",0,"фіз-ра","Тиндик Т.О.",59],[4,"7-В",0,"англ.мова","Маркевич П.В.",20],[4,"7-В",0,"англ.мова","Приймак Л.А.",21],[14,"7-В",0,"технології","Шевчук М.Б.",6],[14,"7-В",0,"технології","Цуркан І.М.",7],[24,"7-В",0,"ЗБД","Тарасюк Р.М.",5],[34,"7-В",0,"геометрія","Олійник Т.М.",19],[44,"7-В",0,"англ.мова","Маркевич П.В.",15],[44,"7-В",0,"англ.мова","Приймак Л.А.",21],[5,"7-В",0,"фіз-ра","Тиндик Т.О.",59],[15,"7-В",0,"історія Укр.","Плетінка В.М.",25],[25,"7-В",0,"фіз-ра","Тиндик Т.О.",59],[35,"7-В",0,"фізика","Когут С.С.",34],[45,"7-В",0,"укр.мова","Малко Н.Я.",31],[45,"7-В",0,"укр.мова","Дубецька С.Я.",23],[6,"7-В",0,"біологія","Кузій О.І.",1],[16,"7-В",0,"заруб.літ.","Кардинал О.П.",30],[26,"7-В",0,"мистецтво","Цуркан І.М.",7],[36,"7-В",1,"STEM","Тарасюк Р.М.",5],[36,"7-В",1,"STEM","Кузій О.І.",29],[46,"7-В",0,"укр.літ.","Македонська О.Р.",8],[30,"7-В",-1,"гром.освіта","Плетінка В.М.",25],[42,"7-В",-1,"заруб.літ.","Кардинал О.П.",30],[36,"7-В",-1,"англ.мова","Маркевич П.В.",15],[36,"7-В",-1,"англ.мова","Приймак Л.А.",21],[0,"7-Г",0,"алгебра","Олійник Т.М.",19],[10,"7-Г",0,"геометрія","Олійник Т.М.",19],[20,"7-Г",0,"англ.мова","Маркевич П.В.",20],[20,"7-Г",0,"англ.мова","Приймак Л.А.",21],[30,"7-Г",0,"мистецтво","Цуркан І.М.",7],[40,"7-Г",0,"алгебра","Олійник Т.М.",19],[1,"7-Г",0,"фіз-ра","Тиндик Т.О.",59],[11,"7-Г",0,"фіз-ра","Тиндик Т.О.",59],[21,"7-Г",0,"хімія","Кузій О.І.",29],[31,"7-Г",0,"інформатика","Білібін Р.В.",24],[31,"7-Г",0,"інформатика","Смоляк І.Я.",32],[41,"7-Г",0,"укр.літ.","Македонська О.Р.",8],[2,"7-Г",0,"фізика","Когут С.С.",34],[12,"7-Г",0,"історія Укр.","Плетінка В.М.",25],[22,"7-Г",0,"алгебра","Олійник Т.М.",19],[32,"7-Г",0,"укр.мова","Македонська О.Р.",8],[32,"7-Г",0,"укр.мова","Малко Н.Я.",31],[42,"7-Г",0,"укр.мова","Македонська О.Р.",8],[42,"7-Г",0,"укр.мова","Малко Н.Я.",31],[3,"7-Г",0,"англ.мова","Маркевич П.В.",20],[3,"7-Г",0,"англ.мова","Приймак Л.А.",21],[13,"7-Г",0,"заруб.літ.","Кардинал О.П.",30],[23,"7-Г",0,"укр.мова","Македонська О.Р.",8],[23,"7-Г",0,"укр.мова","Малко Н.Я.",31],[33,"7-Г",0,"геометрія","Олійник Т.М.",19],[43,"7-Г",0,"біологія","Тарасюк Р.М.",5],[4,"7-Г",0,"укр.мова","Македонська О.Р.",8],[4,"7-Г",0,"укр.мова","Малко Н.Я.",31],[14,"7-Г",0,"STEM","Тарасюк Р.М.",5],[14,"7-Г",0,"STEM","Кузій О.І.",26],[24,"7-Г",1,"всв.історія","Плетінка В.М.",25],[34,"7-Г",0,"географія","Тарасюк Р.М.",5],[44,"7-Г",0,"фіз-ра","Тиндик Т.О.",59],[5,"7-Г",0,"музика","Паралюш О.М.",3],[15,"7-Г",0,"технології","Шевчук М.Б.",6],[15,"7-Г",0,"технології","Цуркан І.М.",7],[25,"7-Г",0,"ЗБД","Тарасюк Р.М.",5],[35,"7-Г",0,"англ.мова","Маркевич П.В.",15],[35,"7-Г",0,"англ.мова","Приймак Л.А.",5],[45,"7-Г",1,"інформатика","Білібін Р.В.",24],[6,"7-Г",0,"географія","Тарасюк Р.М.",5],[16,"7-Г",0,"біологія","Тарасюк Р.М.",5],[26,"7-Г",0,"укр.літ.","Македонська О.Р.",8],[36,"7-Г",0,"фізика","Когут С.С.",34],[46,"7-Г",1,"STEM","Тарасюк Р.М.",5],[46,"7-Г",1,"STEM","Кузій О.І.",1],[24,"7-Г",-1,"гром.освіта","Плетінка В.М.",25],[45,"7-Г",-1,"заруб.літ.","Кардинал О.П.",30],[46,"7-Г",-1,"англ.мова","Маркевич П.В.",20],[46,"7-Г",-1,"англ.мова","Приймак Л.А.",1],[0,"8-А",0,"біологія","Горбач Л.Ф.",17],[10,"8-А",0,"англ.мова","Коваль О.В.",35],[20,"8-А",0,"алгебра","Курій Т.Б.",16],[30,"8-А",0,"фізика","Когут С.С.",34],[40,"8-А",1,"алгебра","Курій Т.Б.",35],[1,"8-А",0,"алгебра","Курій Т.Б.",16],[11,"8-А",0,"геометрія","Курій Т.Б.",35],[21,"8-А",0,"алгебра","Курій Т.Б.",35],[31,"8-А",0,"англ.мова","Коваль О.В.",35],[41,"8-А",0,"історія","Плетінка В.М.",25],[2,"8-А",0,"хімія","Федюк Н.М.",35],[12,"8-А",0,"інформатика","Білібін Р.В.",24],[12,"8-А",0,"інформатика","Смоляк І.Я.",32],[22,"8-А",0,"англ.мова","Коваль О.В.",35],[32,"8-А",0,"укр.мова","Турко Г.Б.",35],[42,"8-А",0,"фіз-ра","Дубик М.І.",59],[3,"8-А",0,"англ.мова","Коваль О.В.",35],[13,"8-А",0,"укр.мова","Турко Г.Б.",35],[23,"8-А",0,"укр.мова","Турко Г.Б.",35],[33,"8-А",1,"інформатика","Білібін Р.В.",24],[33,"8-А",1,"інформатика","Смоляк І.Я.",32],[43,"8-А",0,"географія","Лемеха О.В.",18],[4,"8-А",0,"історія","Плетінка В.М.",25],[14,"8-А",0,"заруб.літ.","Друзь О.Ф.",31],[24,"8-А",0,"укр.літ.","Турко Г.Б.",35],[34,"8-А",0,"укр.літ.","Турко Г.Б.",35],[44,"8-А",0,"англ.мова","Коваль О.В.",35],[5,"8-А",0,"технології","Шевчук М.Б.",6],[15,"8-А",0,"фізика","Когут С.С.",34],[25,"8-А",0,"біологія","Горбач Л.Ф.",17],[35,"8-А",0,"геометрія","Курій Т.Б.",35],[45,"8-А",0,"навч. разом","Турко Г.Б.",35],[6,"8-А",0,"фіз-ра","Дубик М.І.",59],[16,"8-А",0,"географія","Лемеха О.В.",18],[26,"8-А",0,"фіз-ра","Дубик М.І.",59],[36,"8-А",0,"хімія","Федюк Н.М.",35],[7,"8-А",1,"музика","Паралюш О.М.",3],[40,"8-А",-1,"геометрія","Курій Т.Б.",35],[33,"8-А",-1,"еврика","Курій Т.Б.",16],[46,"8-А",-1,"історія","Плетінка В.М.",25],[7,"8-А",-1,"мистецтво","Цуркан І.М.",7],[37,"8-А",-1,"заруб.літ.","Друзь О.Ф.",31],[0,"8-Б",0,"фіз-ра","Тиндик Т.О.",59],[10,"8-Б",0,"геометрія","Шпорлюк Г.М.",23],[20,"8-Б",0,"біологія","Горбач Л.Ф.",17],[30,"8-Б",0,"геометрія","Шпорлюк Г.М.",23],[40,"8-Б",0,"алгебра","Шпорлюк Г.М.",23],[1,"8-Б",0,"алгебра","Шпорлюк Г.М.",23],[11,"8-Б",0,"інформатика","Білібін Р.В.",24],[11,"8-Б",0,"інформатика","Смоляк І.Я.",32],[21,"8-Б",0,"алгебра","Шпорлюк Г.М.",23],[31,"8-Б",0,"фізика","Когут С.С.",34],[41,"8-Б",0,"технології","Шевчук М.Б.",6],[41,"8-Б",0,"технології","Цуркан І.М.",7],[2,"8-Б",0,"біологія","Горбач Л.Ф.",18],[12,"8-Б",0,"укр.мова","Малко Н.Я.",31],[12,"8-Б",0,"укр.мова","Турко Г.Б.",35],[22,"8-Б",0,"географія","Тарасюк Р.М.",5],[32,"8-Б",0,"фіз-ра","Тиндик Т.О.",59],[42,"8-Б",0,"англ.мова","Сторощук Н.І.",21],[42,"8-Б",0,"англ.мова","Коваль О.В.",19],[3,"8-Б",0,"укр.мова","Малко Н.Я.",31],[3,"8-Б",0,"укр.мова","Турко Г.Б.",27],[13,"8-Б",0,"заруб.літ.","Друзь О.Ф.",31],[23,"8-Б",0,"фіз-ра","Тиндик Т.О.",59],[33,"8-Б",0,"географія","Тарасюк Р.М.",5],[43,"8-Б",0,"нім.мова","Шеремета І.М.",15],[43,"8-Б",0,"нім.мова","Приймак Л.А.",15],[4,"8-Б",0,"хімія","Федюк Н.М.",29],[14,"8-Б",0,"укр.літ.","Малко Н.Я.",31],[24,"8-Б",0,"нім.мова","Шеремета І.М.",15],[24,"8-Б",0,"нім.мова","Приймак Л.А.",21],[34,"8-Б",0,"хімія","Федюк Н.М.",29],[44,"8-Б",1,"STEM","Федюк Н.М.",29],[44,"8-Б",1,"STEM","Кузій О.І.",1],[5,"8-Б",0,"історія Укр.","Плетінка В.М.",25],[15,"8-Б",0,"англ.мова","Сторощук Н.І.",21],[15,"8-Б",0,"англ.мова","Коваль О.В.",20],[25,"8-Б",0,"STEM","Федюк Н.М.",29],[25,"8-Б",0,"STEM","Кузій О.І.",1],[35,"8-Б",0,"укр.мова","Малко Н.Я.",26],[35,"8-Б",0,"укр.мова","Турко Г.Б.",1],[45,"8-Б",1,"ЗБД","Гумен Б.Б.",4],[6,"8-Б",0,"всв.історія","Плетінка В.М.",25],[16,"8-Б",0,"фізика","Когут С.С.",34],[26,"8-Б",0,"англ.мова","Сторощук Н.І.",21],[26,"8-Б",0,"англ.мова","Коваль О.В.",33],[36,"8-Б",1,"інформатика","Білібін Р.В.",24],[36,"8-Б",1,"інформатика","Смоляк І.Я.",32],[46,"8-Б",1,"укр.літ.","Малко Н.Я.",31],[7,"8-Б",1,"мистецтво","Цуркан І.М.",7],[27,"8-Б",1,"гром.освіта","Плетінка В.М.",25],[44,"8-Б",-1,"історія Укр.","Плетінка В.М.",25],[45,"8-Б",-1,"фінанс.грам.","Гумен Б.Б.",4],[36,"8-Б",-1,"заруб.літ.","Друзь О.Ф.",31],[7,"8-Б",-1,"музика","Паралюш О.М.",3],[0,"8-В",0,"укр.мова","Малко Н.Я.",20],[0,"8-В",0,"укр.мова","Денисюк Л.К.",15],[10,"8-В",0,"укр.літ.","Малко Н.Я.",31],[20,"8-В",0,"укр.мова","Малко Н.Я.",31],[20,"8-В",0,"укр.мова","Денисюк Л.К.",15],[30,"8-В",0,"хімія","Федюк Н.М.",29],[40,"8-В",0,"географія","Тарасюк Р.М.",5],[1,"8-В",0,"біологія","Горбач Л.Ф.",17],[11,"8-В",0,"укр.мова","Малко Н.Я.",31],[11,"8-В",0,"укр.мова","Денисюк Л.К.",15],[21,"8-В",0,"хімія","Федюк Н.М.",1],[31,"8-В",0,"алгебра","Курій Т.Б.",16],[41,"8-В",0,"укр.мова","Малко Н.Я.",35],[41,"8-В",0,"укр.мова","Денисюк Л.К.",15],[2,"8-В",0,"англ.мова","Сторощук Н.І.",21],[2,"8-В",0,"англ.мова","Коваль О.В.",29],[12,"8-В",1,"географія","Тарасюк Р.М.",5],[22,"8-В",0,"геометрія","Курій Т.Б.",19],[32,"8-В",0,"англ.мова","Сторощук Н.І.",21],[32,"8-В",0,"англ.мова","Коваль О.В.",23],[42,"8-В",0,"фіз-ра","Тиндик Т.О.",59],[3,"8-В",0,"історія Укр.","Плетінка В.М.",25],[13,"8-В",0,"інформатика","Смоляк І.Я.",32],[13,"8-В",0,"інформатика","Білібін Р.В.",24],[23,"8-В",0,"STEM","Тарасюк Р.М.",5],[23,"8-В",0,"STEM","Кузій О.І.",1],[33,"8-В",0,"фіз-ра","Тиндик Т.О.",59],[43,"8-В",0,"фізика","Когут С.С.",34],[4,"8-В",0,"алгебра","Курій Т.Б.",16],[14,"8-В",0,"алгебра","Курій Т.Б.",19],[24,"8-В",0,"біологія","Горбач Л.Ф.",17],[34,"8-В",0,"всв.історія","Плетінка В.М.",25],[44,"8-В",0,"технології","Шевчук М.Б.",6],[44,"8-В",0,"технології","Цуркан І.М.",7],[5,"8-В",0,"геометрія","Курій Т.Б.",23],[15,"8-В",0,"фіз-ра","Тиндик Т.О.",59],[25,"8-В",0,"англ.мова","Сторощук Н.І.",4],[25,"8-В",0,"англ.мова","Коваль О.В.",33],[35,"8-В",1,"інформатика","Смоляк І.Я.",32],[35,"8-В",1,"інформатика","Білібін Р.В.",24],[45,"8-В",1,"STEM","Тарасюк Р.М.",5],[45,"8-В",1,"STEM","Кузій О.І.",1],[6,"8-В",0,"фізика","Когут С.С.",34],[16,"8-В",0,"заруб.літ.","Друзь О.Ф.",31],[36,"8-В",0,"укр.літ.","Малко Н.Я.",26],[46,"8-В",1,"ЗБД","Гумен Б.Б.",4],[17,"8-В",1,"мистецтво","Цуркан І.М.",7],[35,"8-В",-1,"заруб.літ.","Друзь О.Ф.",31],[45,"8-В",-1,"історія Укр.","Плетінка В.М.",25],[26,"8-В",-1,"гром.освіта","Плетінка В.М.",25],[46,"8-В",-1,"фінанс.грам.","Гумен Б.Б.",4],[17,"8-В",-1,"музика","Паралюш О.М.",3],[0,"8-Г",0,"алгебра","Шпорлюк Г.М.",23],[10,"8-Г",0,"укр.мова","Македонська О.Р.",8],[10,"8-Г",0,"укр.мова","Денисюк Л.К.",15],[20,"8-Г",0,"географія","Тарасюк Р.М.",5],[30,"8-Г",0,"англ.мова","Сторощук Н.І.",20],[30,"8-Г",0,"англ.мова","Коваль О.В.",35],[40,"8-Г",0,"укр.мова","Македонська О.Р.",8],[40,"8-Г",0,"укр.мова","Денисюк Л.К.",15],[1,"8-Г",0,"укр.мова","Македонська О.Р.",8],[1,"8-Г",0,"укр.мова","Денисюк Л.К.",15],[11,"8-Г",0,"геометрія","Шпорлюк Г.М.",23],[21,"8-Г",0,"укр.мова","Македонська О.Р.",8],[21,"8-Г",0,"укр.мова","Денисюк Л.К.",15],[31,"8-Г",0,"геометрія","Шпорлюк Г.М.",23],[41,"8-Г",0,"алгебра","Шпорлюк Г.М.",15],[2,"8-Г",0,"біологія","Тарасюк Р.М.",5],[12,"8-Г",0,"англ.мова","Сторощук Н.І.",21],[12,"8-Г",0,"англ.мова","Коваль О.В.",20],[22,"8-Г",0,"алгебра","Шпорлюк Г.М.",23],[32,"8-Г",0,"хімія","Федюк Н.М.",29],[42,"8-Г",0,"всв.історія","Плетінка В.М.",25],[3,"8-Г",0,"географія","Тарасюк Р.М.",5],[13,"8-Г",0,"фіз-ра","Дубик М.І.",59],[23,"8-Г",0,"фіз-ра","Дубик М.І.",59],[33,"8-Г",0,"фізика","Когут С.С.",34],[43,"8-Г",1,"STEM","Федюк Н.М.",29],[43,"8-Г",1,"STEM","Кузій О.І.",1],[4,"8-Г",0,"фізика","Когут С.С.",34],[14,"8-Г",0,"історія Укр.","Плетінка В.М.",25],[24,"8-Г",0,"STEM","Федюк Н.М.",29],[24,"8-Г",0,"STEM","Кузій О.І.",1],[34,"8-Г",1,"інформатика","Білібін Р.В.",24],[34,"8-Г",1,"інформатика","Смоляк І.Я.",32],[44,"8-Г",0,"біологія","Тарасюк Р.М.",5],[5,"8-Г",0,"укр.літ.","Македонська О.Р.",8],[15,"8-Г",0,"заруб.літ.","Друзь О.Ф.",31],[25,"8-Г",0,"укр.літ.","Македонська О.Р.",8],[35,"8-Г",0,"фіз-ра","Дубик М.І.",59],[45,"8-Г",0,"технології","Шевчук М.Б.",6],[45,"8-Г",0,"технології","Цуркан І.М.",7],[6,"8-Г",0,"хімія","Федюк Н.М.",29],[16,"8-Г",0,"інформатика","Білібін Р.В.",24],[16,"8-Г",0,"інформатика","Смоляк І.Я.",32],[26,"8-Г",1,"гром.освіта","Плетінка В.М.",25],[36,"8-Г",1,"ЗБД","Гумен Б.Б.",4],[46,"8-Г",0,"англ.мова","Сторощук Н.І.",21],[46,"8-Г",0,"англ.мова","Коваль О.В.",28],[17,"8-Г",1,"музика","Паралюш О.М.",3],[43,"8-Г",-1,"історія Укр.","Плетінка В.М.",25],[34,"8-Г",-1,"заруб.літ.","Друзь О.Ф.",31],[36,"8-Г",-1,"фінанс.грам.","Гумен Б.Б.",4],[17,"8-Г",-1,"мистецтво","Цуркан І.М.",7],[0,"9-А",0,"інформатика","Кіт Н.П.",32],[0,"9-А",0,"інформатика","Білібін Р.В.",24],[10,"9-А",0,"укр.мова","Турко Г.Б.",16],[20,"9-А",0,"фізика","Когут С.С.",34],[30,"9-А",0,"геометрія","Курій Т.Б.",16],[40,"9-А",0,"історія","Косів В.В.",16],[1,"9-А",0,"заруб.літ.","Кардинал О.П.",30],[11,"9-А",0,"фізика","Когут С.С.",34],[21,"9-А",0,"укр.мова","Турко Г.Б.",16],[31,"9-А",0,"географія","Лемеха О.В.",18],[41,"9-А",0,"фізика","Когут С.С.",34],[2,"9-А",0,"англ.мова","Маркевич П.В.",16],[12,"9-А",0,"алгебра","Курій Т.Б.",16],[22,"9-А",0,"англ.мова","Маркевич П.В.",16],[32,"9-А",0,"англ.мова","Маркевич П.В.",16],[42,"9-А",0,"хімія","Федюк Н.М.",16],[3,"9-А",0,"алгебра","Курій Т.Б.",16],[13,"9-А",0,"геометрія","Курій Т.Б.",16],[23,"9-А",0,"алгебра","Курій Т.Б.",16],[33,"9-А",1,"історія","Косів В.В.",16],[43,"9-А",1,"алгебра","Курій Т.Б.",16],[4,"9-А",0,"фіз-ра","Дубик М.І.",59],[14,"9-А",0,"англ.мова","Маркевич П.В.",16],[24,"9-А",0,"інформатика","Кіт Н.П.",32],[24,"9-А",0,"інформатика","Білібін Р.В.",24],[34,"9-А",0,"біологія","Горбач Л.Ф.",17],[44,"9-А",0,"навч. разом","Курій Т.Б.",16],[5,"9-А",0,"укр.літ.","Турко Г.Б.",16],[15,"9-А",0,"історія","Косів В.В.",16],[25,"9-А",0,"заруб.літ.","Кардинал О.П.",30],[35,"9-А",0,"хімія","Федюк Н.М.",16],[45,"9-А",0,"англ.мова","Маркевич П.В.",16],[6,"9-А",0,"право","Косів В.В.",19],[16,"9-А",0,"фіз-ра","Дубик М.І.",59],[26,"9-А",1,"укр.літ.","Турко Г.Б.",16],[36,"9-А",0,"укр.мова","Турко Г.Б.",16],[46,"9-А",0,"біологія","Горбач Л.Ф.",17],[37,"9-А",0,"фіз-ра","Дубик М.І.",59],[33,"9-А",-1,"труд.навч.","Шевчук М.Б.",6],[43,"9-А",-1,"геометрія","Курій Т.Б.",16],[26,"9-А",-1,"географія","Лемеха О.В.",18],[0,"9-Б",0,"фіз-ра","Дубик М.І.",59],[10,"9-Б",0,"біологія","Федюк Н.М.",1],[20,"9-Б",0,"біологія","Федюк Н.М.",1],[30,"9-Б",0,"англ.мова","Маркевич П.В.",30],[40,"9-Б",0,"фізика","Когут С.С.",34],[1,"9-Б",0,"алгебра","Олійник Т.М.",19],[11,"9-Б",0,"хімія","Кузій О.І.",29],[21,"9-Б",0,"всв.історія","Косів В.В.",11],[31,"9-Б",0,"хімія","Кузій О.І.",31],[41,"9-Б",0,"інформатика","Кіт Н.П.",18],[2,"9-Б",0,"заруб.літ.","Друзь О.Ф.",31],[12,"9-Б",0,"фізика","Когут С.С.",34],[22,"9-Б",0,"фізика","Когут С.С.",34],[32,"9-Б",0,"геометрія","Олійник Т.М.",19],[42,"9-Б",0,"нім.мова","Шеремета І.М.",15],[3,"9-Б",0,"укр.мова","Боднарчук О.В.",33],[13,"9-Б",0,"геометрія","Олійник Т.М.",19],[23,"9-Б",0,"алгебра","Олійник Т.М.",19],[33,"9-Б",0,"мистецтво","Цуркан І.М.",7],[43,"9-Б",0,"укр.літ.","Боднарчук О.В.",33],[4,"9-Б",0,"право","Косів В.В.",19],[14,"9-Б",0,"укр.літ.","Боднарчук О.В.",33],[24,"9-Б",0,"заруб.літ.","Друзь О.Ф.",31],[34,"9-Б",1,"всв.історія","Косів В.В.",18],[44,"9-Б",0,"основи здор.","Гумен Б.Б.",4],[5,"9-Б",0,"географія","Лемеха О.В.",18],[15,"9-Б",0,"англ.мова","Маркевич П.В.",19],[25,"9-Б",0,"фіз-ра","Дубик М.І.",59],[35,"9-Б",0,"укр.мова","Боднарчук О.В.",33],[45,"9-Б",0,"фіз-ра","Дубик М.І.",59],[6,"9-Б",0,"інформатика","Кіт Н.П.",32],[16,"9-Б",1,"історія Укр.","Косів В.В.",11],[26,"9-Б",0,"нім.мова","Шеремета І.М.",15],[36,"9-Б",0,"труд.навч.","Цуркан І.М.",7],[34,"9-Б",-1,"географія","Лемеха О.В.",18],[16,"9-Б",-1,"всв.історія","Косів В.В.",11],[46,"9-Б",-1,"христ.етика","Павлів О.Я.",33],[0,"9-В",0,"право","Косів В.В.",25],[10,"9-В",0,"укр.літ.","Дубецька С.Я.",25],[20,"9-В",0,"алгебра","Олійник Т.М.",19],[30,"9-В",0,"геометрія","Олійник Т.М.",19],[40,"9-В",0,"хімія","Федюк Н.М.",29],[1,"9-В",0,"заруб.літ.","Друзь О.Ф.",31],[11,"9-В",0,"біологія","Федюк Н.М.",1],[21,"9-В",0,"інформатика","Смоляк І.Я.",32],[21,"9-В",0,"інформатика","Кіт Н.П.",24],[31,"9-В",0,"труд.навч.","Шевчук М.Б.",6],[31,"9-В",0,"труд.навч.","Цуркан І.М.",7],[41,"9-В",0,"біологія","Федюк Н.М.",29],[2,"9-В",0,"алгебра","Олійник Т.М.",19],[12,"9-В",0,"геометрія","Олійник Т.М.",19],[22,"9-В",0,"нім.мова","Шеремета І.М.",15],[22,"9-В",0,"нім.мова","Приймак Л.А.",21],[32,"9-В",0,"укр.мова","Дубецька С.Я.",23],[32,"9-В",0,"укр.мова","Боднарчук О.В.",30],[42,"9-В",0,"основи здор.","Гумен Б.Б.",4],[3,"9-В",0,"географія","Лемеха О.В.",18],[13,"9-В",0,"англ.мова","Маркевич П.В.",11],[13,"9-В",0,"англ.мова","Приймак Л.А.",1],[23,"9-В",0,"хімія","Федюк Н.М.",29],[33,"9-В",0,"англ.мова","Маркевич П.В.",15],[33,"9-В",0,"англ.мова","Приймак Л.А.",6],[43,"9-В",0,"всв.історія","Косів В.В.",19],[4,"9-В",0,"інформатика","Смоляк І.Я.",32],[4,"9-В",0,"інформатика","Кіт Н.П.",24],[14,"9-В",0,"фізика","Когут С.С.",34],[24,"9-В",0,"фізика","Когут С.С.",34],[34,"9-В",0,"фіз-ра","Дубик М.І.",59],[44,"9-В",0,"фіз-ра","Дубик М.І.",59],[5,"9-В",0,"фіз-ра","Дубик М.І.",59],[15,"9-В",0,"укр.мова","Дубецька С.Я.",23],[15,"9-В",0,"укр.мова","Боднарчук О.В.",33],[25,"9-В",1,"історія Укр.","Косів В.В.",19],[35,"9-В",0,"укр.літ.","Дубецька С.Я.",23],[45,"9-В",0,"нім.мова","Шеремета І.М.",15],[45,"9-В",0,"нім.мова","Приймак Л.А.",1],[6,"9-В",1,"христ.етика","Павлів О.Я.",23],[16,"9-В",0,"мистецтво","Цуркан І.М.",7],[26,"9-В",0,"заруб.літ.","Друзь О.Ф.",31],[36,"9-В",1,"всв.історія","Косів В.В.",18],[46,"9-В",0,"фізика","Когут С.С.",34],[25,"9-В",-1,"всв.історія","Косів В.В.",19],[36,"9-В",-1,"географія","Лемеха О.В.",18],[0,"9-Г",0,"заруб.літ.","Друзь О.Ф.",31],[10,"9-Г",0,"фізика","Когут С.С.",34],[20,"9-Г",0,"алгебра","Шпорлюк Г.М.",23],[30,"9-Г",0,"фіз-ра","Тиндик Т.О.",59],[40,"9-Г",0,"мистецтво","Цуркан І.М.",7],[1,"9-Г",0,"право","Косів В.В.",25],[11,"9-Г",0,"укр.мова","Дубецька С.Я.",25],[11,"9-Г",0,"укр.мова","Боднарчук О.В.",30],[21,"9-Г",0,"нім.мова","Шеремета І.М.",15],[21,"9-Г",0,"нім.мова","Приймак Л.А.",21],[31,"9-Г",0,"укр.мова","Дубецька С.Я.",21],[31,"9-Г",0,"укр.мова","Боднарчук О.В.",30],[41,"9-Г",0,"нім.мова","Шеремета І.М.",15],[41,"9-Г",0,"нім.мова","Приймак Л.А.",21],[2,"9-Г",0,"алгебра","Шпорлюк Г.М.",23],[12,"9-Г",0,"хімія","Кузій О.І.",29],[22,"9-Г",0,"інформатика","Смоляк І.Я.",32],[22,"9-Г",0,"інформатика","Кіт Н.П.",24],[32,"9-Г",0,"біологія","Кузій О.І.",28],[42,"9-Г",0,"фізика","Когут С.С.",34],[3,"9-Г",0,"геометрія","Шпорлюк Г.М.",23],[13,"9-Г",0,"фіз-ра","Тиндик Т.О.",59],[23,"9-Г",0,"геометрія","Шпорлюк Г.М.",23],[33,"9-Г",0,"хімія","Кузій О.І.",29],[43,"9-Г",0,"основи здор.","Гумен Б.Б.",4],[4,"9-Г",0,"географія","Лемеха О.В.",18],[14,"9-Г",0,"англ.мова","Коваль О.В.",20],[14,"9-Г",0,"англ.мова","Приймак Л.А.",1],[24,"9-Г",0,"всв.історія","Косів В.В.",8],[34,"9-Г",0,"англ.мова","Коваль О.В.",20],[34,"9-Г",0,"англ.мова","Приймак Л.А.",21],[44,"9-Г",0,"всв.історія","Косів В.В.",3],[5,"9-Г",0,"інформатика","Смоляк І.Я.",32],[5,"9-Г",0,"інформатика","Кіт Н.П.",24],[15,"9-Г",0,"біологія","Кузій О.І.",26],[25,"9-Г",0,"заруб.літ.","Друзь О.Ф.",31],[35,"9-Г",1,"історія Укр.","Косів В.В.",18],[45,"9-Г",0,"укр.літ.","Боднарчук О.В.",33],[6,"9-Г",0,"фіз-ра","Тиндик Т.О.",59],[26,"9-Г",0,"фізика","Когут С.С.",34],[36,"9-Г",0,"укр.літ.","Боднарчук О.В.",33],[46,"9-Г",0,"труд.навч.","Шевчук М.Б.",6],[46,"9-Г",0,"труд.навч.","Цуркан І.М.",7],[35,"9-Г",-1,"географія","Лемеха О.В.",18],[16,"9-Г",-1,"христ.етика","Павлів О.Я.",33],[0,"9-Д",0,"заруб.літ.","Кардинал О.П.",30],[10,"9-Д",0,"хімія","Кузій О.І.",29],[20,"9-Д",0,"всв.історія","Косів В.В.",11],[30,"9-Д",0,"алгебра","Чуприна О.В.",26],[40,"9-Д",0,"нім.мова","Шеремета І.М.",15],[1,"9-Д",0,"інформатика","Білібін Р.В.",24],[1,"9-Д",0,"інформатика","Кіт Н.П.",32],[11,"9-Д",0,"англ.мова","Маркевич П.В.",1],[21,"9-Д",0,"фізика","Когут С.С.",34],[31,"9-Д",0,"англ.мова","Маркевич П.В.",19],[41,"9-Д",0,"основи здор.","Гумен Б.Б.",4],[2,"9-Д",0,"фіз-ра","Тиндик Т.О.",59],[12,"9-Д",0,"укр.мова","Грушкевич С.З.",15],[22,"9-Д",0,"геометрія","Чуприна О.В.",26],[32,"9-Д",1,"всв.історія","Косів В.В.",18],[42,"9-Д",0,"біологія","Горбач Л.Ф.",18],[3,"9-Д",0,"укр.літ.","Грушкевич С.З.",15],[13,"9-Д",0,"фізика","Когут С.С.",34],[23,"9-Д",1,"історія Укр.","Косів В.В.",7],[33,"9-Д",0,"укр.мова","Грушкевич С.З.",15],[43,"9-Д",0,"мистецтво","Цуркан І.М.",7],[4,"9-Д",0,"алгебра","Чуприна О.В.",26],[14,"9-Д",0,"інформатика","Білібін Р.В.",24],[14,"9-Д",0,"інформатика","Кіт Н.П.",32],[24,"9-Д",0,"заруб.літ.","Кардинал О.П.",30],[34,"9-Д",0,"укр.літ.","Грушкевич С.З.",15],[44,"9-Д",0,"геометрія","Чуприна О.В.",26],[5,"9-Д",0,"право","Косів В.В.",19],[15,"9-Д",0,"географія","Лемеха О.В.",18],[25,"9-Д",0,"нім.мова","Шеремета І.М.",15],[35,"9-Д",0,"хімія","Кузій О.І.",29],[45,"9-Д",0,"фізика","Когут С.С.",34],[6,"9-Д",0,"труд.навч.","Шевчук М.Б.",6],[16,"9-Д",0,"фіз-ра","Тиндик Т.О.",59],[26,"9-Д",0,"фіз-ра","Тиндик Т.О.",59],[36,"9-Д",0,"біологія","Горбач Л.Ф.",17],[46,"9-Д",1,"христ.етика","Павлів О.Я.",33],[32,"9-Д",-1,"географія","Лемеха О.В.",18],[23,"9-Д",-1,"всв.історія","Косів В.В.",1],[11,"інд6А",0,"заруб.літ.","Кардинал О.П.",15],[21,"інд6А",0,"англ.мова","Маркевич П.В.",15],[2,"інд6А",0,"Укр. і світ","Косів В.В.",15],[22,"інд6А",0,"укр.мова","Грушкевич С.З.",15],[32,"інд6А",0,"укр.мова","Грушкевич С.З.",15],[42,"інд6А",1,"географія","Лемеха О.В.",18],[3,"інд6А",0,"математика","Чуприна О.В.",15],[13,"інд6А",0,"МПЗ","Горбач Л.Ф.",15],[23,"інд6А",0,"українська  ","Грушкевич С.З.",15],[33,"інд6А",0,"фіз-ра","Дубик М.І.",59],[43,"інд6А",0,"англ.мова","Маркевич П.В.",15],[14,"інд6А",0,"математика","Чуприна О.В.",15],[44,"інд6А",1,"ТФВ","Когут С.С.",15],[0,"інд6А",-1,"мистецтво","Паралюш О.М.",3],[42,"інд6А",-1,"технології","Шевчук М.Б.",6],[34,"інд6А",-1,"інформатика","Білібін Р.В.",15],[1,"інд8В",1,"фінанс.грам.","Тарасюк Р.М.",5],[31,"інд8В",1,"всв.історія","Плетінка В.М.",15],[41,"інд8В",0,"англ.мова","Коваль О.В.",15],[22,"інд8В",0,"історія Укр.","Плетінка В.М.",15],[42,"інд8В",1,"STEM","Кузій О.І.",15],[3,"інд8В",1,"хімія","Федюк Н.М.",15],[13,"інд8В",1,"музика","Паралюш О.М.",3],[43,"інд8В",0,"укр.мова","Малко Н.Я.",31],[14,"інд8В",0,"біологія","Горбач Л.Ф.",17],[24,"інд8В",0,"українська  ","Малко Н.Я.",31],[34,"інд8В",0,"укр.мова","Малко Н.Я.",31],[6,"інд8В",0,"заруб.літ.","Кардинал О.П.",15],[8,"інд8В",0,"алгебра","Каравець Г.М.",15],[18,"інд8В",0,"геометрія","Каравець Г.М.",16],[1,"інд8В",-1,"ЗБД","Тарасюк Р.М.",15],[1,"інд8В",-1,"географія","Тарасюк Р.М.",15],[31,"інд8В",-1,"гром.освіта","Плетінка В.М.",15],[32,"інд8В",-1,"технології","Шевчук М.Б.",6],[42,"інд8В",-1,"інформатика","Білібін Р.В.",24],[23,"інд8В",-1,"фізика","Когут С.С.",15],[1,"інд9Д",0,"укр.мова","Грушкевич С.З.",15],[41,"інд9Д",0,"біологія","Горбач Л.Ф.",15],[2,"інд9Д",0,"українська  ","Грушкевич С.З.",15],[12,"інд9Д",0,"алгебра","Шпорлюк Г.М.",15],[22,"інд9Д",0,"англ.мова","Пронів Х.І.",15],[32,"інд9Д",0,"геометрія","Шпорлюк Г.М.",15],[42,"інд9Д",1,"труд.навч.","Шевчук М.Б.",6],[3,"інд9Д",1,"історія Укр.","Косів В.В.",15],[23,"інд9Д",1,"фізика","Когут С.С.",15],[43,"інд9Д",1,"укр.мова","Грушкевич С.З.",15],[14,"інд9Д",1,"мистецтво","Паралюш О.М.",3],[34,"інд9Д",0,"хімія","Кузій О.І.",15],[44,"інд9Д",0,"нім.мова","Шеремета І.М.",15],[5,"інд9Д",0,"заруб.літ.","Кардинал О.П.",15],[26,"інд9Д",1,"право","Косів В.В.",15],[21,"інд9Д",-1,"основи здор.","Тарасюк Р.М.",5],[3,"інд9Д",-1,"всв.історія","Косів В.В.",36],[13,"інд9Д",-1,"географія","Лемеха О.В.",18],[43,"інд9Д",-1,"інформатика","Білібін Р.В.",24],]
